import React from 'react';

export const History = () => {
  return (
    <div className='history'>
      <p>
      Товариство «Просвіта» зародилося в Галичині на противагу антиукраїнським течіям у культурному житті: колонізаторській, підтримуваній 
      цісарською владою,- з одного боку, і русофільській, — з другого. Для опрацювання статуту Товариства був створений комітет із 
      представників академічної молоді, а також із таких діячів, як доктор Корнило Сушкевич, Михайло Коссак, професор гімназії Павлин 
      Свєнціцький та ін. 2 вересня 1868 року Міністерство освіти дозволило заснувати Товариство «Просвіта».<br /> 
      <br />
      Це стало підставою для скликання у Львові першого загального збору. Його організація була доручена конституційному комітетові на чолі 
      з професором академічної гімназії Анатолем Вахнянином. Загальний збір був скликаний 8 грудня 1868 в залі польської «Стрільниці» на 
      вулиці Курковій. На збір прибуло 65 представників, лише один із них, отець Йосип Заячківський, не був мешканцем Львова. Програма 
      майбутньої праці «Просвіти» була коротко сформульована у виступі студента Андрія Січинського:«Кожний нарід, що хоче добитися 
      самостійности, мусить передусім дбати про те, щоби нижчі верстви суспільности, народні маси піднеслися до тої степени просвіти, щоб 
      ця народна маса почула себе членом народнього організму, відчула своє горожанське й національне достоїнство й узнала потребу 
      існування нації як окремішньої народної індивідуальности; бо ніхто інший, а маса народу є підставою усього». Головою новоствореного 
      Товариства збір обрав Анатоля Вахнянина, а до виділу (керівного органу) — Олександра Борковського, Івана Комарницького, Михайла 
      Коссака, Максима Михаляка, Омеляна Огоновського, Омеляна Партицького, Юліана Романчука, Корнила Сушкевича і Корнила Устияновича. 
      Вирішено було створити українську бібліотеку з читальнею і щорічно видавати календар для народу. Загальний збір «Просвіти» отримав 
      привітання від українських народовських громад Бережан, Тернополя, Перемишля, Станіславова і Чернівців, від студентських товариств 
      «Січ» і «Основа» у Відні. Вітальні телеграми надійшли з Чехії, Сербії та Словаччини.<br />
      <br />
      Тим часом москвофільське «Слово» назвало Товариство «польською інтригою». Щоб роз’яснити мету Товариства, його виділ звернувся 11 
      лютого 1869 року зі спеціальною відозвою до народу. У ній указувалося, що «поза школою не знаходить українська дитина ніякого 
      духовного корму, через котрий самосвідомість, моральність і добробут у народі могли би чимраз більше розвиватися». Товариство 
      працювало у складних умовах. Воно не мало приміщення, а тому наради і засідання проводили вдома у К. Сушкевича або А. Вахнянина. 
      Плідно працювала просвітницька секція, шо розпочала видавати для народу популярні книжечки і готувати підручники для єдиної 
      української гімназії. Редактором популярних видань став письменник Юрій Федькович. Товариство домовилося про книгообмін з польськими 
      та чеськими освітніми товариствами. 26 травня 1870 року відбувся другий загальний збір Товариства. І знову довелося просити 
      приміщення у польської «Стрільниці». Збір визначив нові принципи роботи «Просвіти». На Товариство відразу почалися нападки як 
      намісництва і староств, так і русофільського «Слова». Однак просвітня робота набирала сили.<br />
      <br />
      За два роки було засновано три нові філії «Просвіти», організовувано читальні, почали видавати друкований орган “Письмо з «Просвіти», 
      а з 1880 року під редакцією члена виділу «Просвіти» Володимира Барвінського стала виходити народовська політична газета «Діло». 
      Широка популярність Товариства змусила галицький сейм надати йому 1000 срібних «запомоги», яку згодом збільшено на 50 відсотків.<br />
      <br />
      30 листопада 1880 року з ініціативи В. Барвінського скликано перше українське народне віче у Львові. Віче було однією з форм політичної роботи Товариства. Зі зміною 
      ситуації політична боротьба могла мати для «Просвіти» непередбачені наслідки. Зваживши на це, члени виділу (Омелян Огоновський, Юліан Романчук, Олександр Огоновський, 
      Олександр Стефанович, Іван Белей, Кость Левицький та інші) вирішили створити перше українське політичне товариство «Народна Рада», яке б співпрацювало з «Просвітою». 1884 
      року було засновано ремісниче товариство «Зоря», його очолив один із керівників «Просвіти» Василь Нагірний. За ухвалою загального збору Товариства, який відбувся 25 
      березня 1891 року, читальні «Просвіти» вели курси неписьменних, проводили «відчити», вечорниці, ставили п’єси, а крім того, створювали рільничо-господарські та промислові 
      спілки, позичкові й ошадні каси.<br />
      <br />
      Своє 25-річчя «Просвіта» відзначила дуже урочисто. Разом з іншими українськими товариствами вона організувала перевезення з Новосілок-Міських на Личаківське кладовище 
      останків Маркіяна Шашкевича. Іван Белей підготував коротку «Історію Просвіти». Великим досягненням «Просвіти» була, безперечно, купівля у 1895 році власного будинку. Для 
      цього надійшли пожертвування не тільки з Галичини, а й з Наддніпрянщини. Кияни передали через професора Михайла Грушевського 1500 ринських. 31 січня 1896 року загальний 
      збір «Просвіти» обрав головою Товариства професора Юліана Романчука. Ці обов’язки він виконував цілих десять років. За цей час швидкого розвитку набув кооперативний рух, 
      який покликав до життя в 1898 році «Краєвий Союз Кредитовий», а в 1904 році — нове товариство «Краєвий Союз Ревізійний». Члени «Просвіти» провели маніфестації з нагоди 50- 
      річчя скасування панщини і 100-річчя «Енеїди». На зламі двох віків значно активізується політичне життя, в якому члени «Просвіти» завше йдуть попереду. Саме тоді, 1899 
      року, більшість народовців оформилася в Національно-демократичну партію на чолі з Юліаном Романчуком і Костем Левицьким. Галицька інтелігенція долає консерватизм. Замість 
      самоназви «русин» («руський») поширюється назва «українець» («український»). Водночас запроваджувано фонетичний правопис до популярних видань «Просвіти». Просвітницьку 
      діяльність широ підтримує духовенство, зокрема тодішній станіславівський єпископ Андрей Шептицький. Почуття єдності західних і наддніпрянських земель виявилося під час 
      святкування 12 листопада 1905 року ювілею гетьмана Богдана Хмельницького.<br />
      <br />
      На той час за прикладом Галичини організовуються освітні товариства під назвою «Просвіта» на землях Наддніпрян-щини: спочатку — в Одесі, а згодом — у Катеринославі, 
      Житомирі, Кам’янці-Подільському, Києві, Чернігові, Миколаєві. Цікаво, що власні читальні «Просвіти» мали переселенці навіть на далекосхідному Зеленому Клині та в Америці. 
      Починаючи з 1906 року, «Просвіту» очолювали доктор Євген Олесницький (усього 4 місяці) та Петро Огоновський. 1 листопада 1910 року головою Товариства став судовий радник 
      Іван Кивелюк, який виконував ці обов’язки аж до 1922 року. За його головування «Просвіта», попри тяжке воєнне лихоліття, досягла небачених висот. На загальному зборі 
      Товариства в 1912 році було прийнято новий статут, який поставив завдання широкої культурно-освітньої роботи. Вона передбачала діяльність народного театру і кінотеатру, 
      проведення народних свят, з’їздів і краєзнавчих походів, організацію книгозбірень, народних музеїв, публічних читалень, книгарень, друкарень та інших підприємств, різних 
      курсів і шкіл (народних, середніх, вищих, господарських, промислових, торговельних), ведення зразкових господарств, садів тощо.<br />
      <br />
      Наприкінці 1913 року «Просвіта» мала 77 філій і 2648 читалень. Масово почали створюватися бібліотеки. У віддалені місцевості книжки надходили безплатно. Важливе місце у 
      просвітній праці посіли виклади і відчити, «курси вищої освіти», курси навчання неписьменних. «Просвіта» підтримувала жваві зв’язки з українцями Закарпаття, Хорватії, 
      Боснії, Сполучених Штатів Америки, з багатьма освітніми організаціями. До важливих здобутків «Просвіти» належить святкування ювілейних річниць — 50-річчя від дня смерті 
      Тараса Шевченка, 100-річчя від дня народження Маркіяна Шашкевича, 50-річчя «Руської Бесіди», 40-річчя письменницької діяльності Івана Франка. 13 грудня 1913 року 
      «Просвіта» взяла участь у події надзвичайної ваги — митрополит Андрей Шептицький передав громадськості Львова Національний музей, який він заснував. При цьому «Просвіта» 
      подарувала музеєві цінні пам’ятки зі свого архіву. Кілька місяців тривали ювілейні Шевченківські урочистості.<br />
      <br />
      Цікаво, що читальні та філії, засновані 1914 року, мали ім’я Тараса Шевченка. У масову маніфестацію перетворився «Краєвий Шевченківський здвиг» українських руханкових, 
      пожежних і стрілецьких організацій, що відбувся 28 грудня 1914 року. Свою майстерність показали згуртовані в «Соколах», «Січах» та «Стрілецьких куренях» галицькі юнаки. 
      Російська окупація Львова завдала значної шкоди «Просвіті». Було знищено бібліотеки, читальні, репресовано активних діячів. Деякі з них змушені були виїхати за межі 
      Галичини. Навіть після російського відступу воєнний стан унеможливив Товариству розгорнути свою діяльність. Та все ж вона активізувалась у 1918 році, коли Україна 
      воскресла до державної незалежності. Товариство «Просвіта» допомогло сформувати Міністерство освіти ЗУНР. Терор польської окупаційної влади не оминув і «Просвіту». 
      Заарештованого голову Товариства Івана Кивелюка було вивезено до табору інтернованих біля Кракова. Лише від початку 1920 року знову пожвавилося просвітянське життя. Щоб 
      піднести народний рух, у грудні 1920 року було проведено «Свято Просвіти», а через два місяці відзначено 60-річчя від дня смерті Тараса Шевченка, під час якого створено 
      видавничий фонд «Учітеся, брати мої!». Для збирання матеріалів про історію визвольної боротьби Головний виділ Товариства створив окреме видавництво «Червона Калина».<br />
      <br />
      У п’ятиріччя смерті Івана Франка тлінні останки великого поета були перевезені на нове місце поховання. Одночасно був оголошений конкурс на проект надмогильного 
      пам’ятника. 1 листопада 1921 року відбувся загальний збір, який обрав головою головного Товариства Івана Кивелюка, шо саме сидів під арештом. На жаль, йому не довелося 
      головувати довго: рівно через чотири місяці Іван Кивелюк помер. Більше року «Просвіту» очолював голова міста доктор Іван Брик. У квітні 1923 року загальний збір обрав 
      головою професора Михайла Галущинського. Про розмах організаційної праці в «Просвіті» свідчать такі дані: за п’ять повоєнних років число філій зросло до 96, а читалень 
      «Просвіти» — до 2934, що перевищило передвоєнні дані відповідно на 9 і 65 одиниць. Організаційні успіхи затьмарювали великі борги, які не давали можливості просвітянам 
      розгорнути діяльність на повну силу. Після смерті професора М. Галущинського десятим головою «Просвіти» був обраний Іван Брик. Товариство працювало далі, переборюючи 
      труднощі. У 1928-му, своєму ювілейному році, «Просвіта» мала на землях окупованої Польщею Галичини 2934 читальні і 12 508 безпосередніх членів. Значно слабше працювало 
      Товариство на Волині, Підляшші та Холмщині, де діяло близько 600 його читалень. Розпочатий польською владою на зламі 20-30-х років брутальний наступ на українську культуру 
      призвів до сумних наслідків. Значно скоротилося число читалень і безпосередніх членів «Просвіти», різко зріс в умовах тодішньої економічної кризи її борг. Але Товариство 
      не здавалось і вже 1934 року мало 3046 читалень і близько 500 тисяч членів. Відновлено і відкрито нові читальні. За редакцією професора Василя Сімовича далі виходив 
      ілюстрований науково-популярний місячник «Життя і Знання». Видавалися книжки фірми фонду «Учітеся, брати мої!» — для найширшого загалу української громадськості, новорічні 
      календарі.<br />
      <br />
      Просвітяни організували конференції та перевишкіл бібліотекарів і керівників гуртків самоосвіти й аматорських театрів. 1936 року «Просвіта» мала 83 філії, 3210 читалень, 
      1207 домівок, 3209 бібліотек із фондом 688 186 книжок, 2185 театральних гуртків, 1115 хорів, 138 оркестрів, 550 гуртків самоосвіти, 86 курсів для неписьменних і 262 гуртки 
      просвітянської молоді. У наступні два роки справи були ще кращими. Лише активних членів налічувалося близько півмільйона. Працювало 11 комісій (просвітньо-організаційна, 
      освітньо-виховна, видавнича, бібліотечна, господарсько-фінансова, театрально-співова, для поборювання неписьменності та інші). Урочисто відзначено 70-річчя заснування 
      «Просвіти».<br />
      <br />
      22 травня 1938 року відбулося богослужіння, яке відправив єпископ Микита Будка. Андрей Шептицький освятив новий біло-золотистий прапор «Просвіти» з написом: «В силі духа- 
      перемога народу!». Цей прапор вигаптували жінки з «Народного мистецтва» за проектом Святослава Гординського. Прапор увінчали стрічками голова Наукового Товариства імені 
      Шевченка професор Іван Раковський, голова «Рідної школи» професор Іван Галущинський, представник української кооперації та інших організацій. Після 1937 року «Просвіта» 
      переживала тяжкі часи. Польська влада закривала читальні, особливо на північно-західних землях. Комуністи намагалися через низові читальні пропагувати «великі 
      перетворення» за Збручем. У таких умовах 8 червня 1939 року відбувся в «Театрі Ріжнорідностей» останній загальний збір «Просвіти». Він обрав головою Товариства отця Юліана 
      Дзеровича. 1939 рік став останнім роком існування «Просвіти» на наших землях. Сталінські опричники знищили у центральному будинку Товариства (площа Ринок, 10) його архів, 
      цінні історичні документи і рукописи, друковану продукцію. Так вони вчинили з осередками «Просвіти» і в інших містах і селах. Не дозволили відновити роботу «Просвіти» і 
      гітлерівські окупанти. Відтоді Товариство «Просвіта» існувало лише за межами України, де українські емігранти відсвяткували його сторічний ювілей.<br />
      </p>
    </div>
  )
}
